5ov/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    frontAndBack
    {
        type            patch;
        nFaces          2020;
        startFace       6006;
    }
    inlet
    {
        type            patch;
        nFaces          21;
        startFace       8026;
    }
    outlet
    {
        type            patch;
        nFaces          21;
        startFace       8047;
    }
    lowerWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          40;
        startFace       8068;
    }
    upperWall
    {
        type            patch;
        nFaces          40;
        startFace       8108;
    }
    donald313
    {
        type            wall;
        inGroups        2(donald313Group wall);
        nFaces          436;
        startFace       8148;
    }
)

// ************************************************************************* //
